// // #1
// let arr = ["a", "b", "c"];
// alert(arr);

// // #2
// let arr = ["a", "b", "c"];
// alert(arr[0]);
// alert(arr[1]);
// alert(arr[2]);

// // #3
// let arr = ["a", "b", "c", "d"];
// alert(arr[0] + "+" + arr[1]);
// alert(arr[2] + "+" + arr[3]);

// // #4
// let arr = [2, 5, 3, 9];
// alert(arr[0] * arr[1] + arr[2] * arr[3]);

// // #5
// let obj = { a: 1, b: 2, c: 3 };
// alert(obj["c"]);
// console.log(Object.values(obj["c"]));

// // #6
// let obj = { Коля: "1000", Вася: "500", Петя: "200" };
// alert(
//   "Заробітна плата Петі: " +
//     obj["Петя"] +
//     "," +
//     " Заробітна плата Колі: " +
//     obj["Коля"]
// );

// // #7
// let arr = [
//   0,
//   "понедельник",
//   "вторник",
//   "среда",
//   "четверг",
//   "пятница",
//   "суббота",
//   "воскресенье",
// ];
// alert(arr[4]);

// // #8
// let arr = [
//   0,
//   "понедельник",
//   "вторник",
//   "среда",
//   "четверг",
//   "пятница",
//   "суббота",
//   "воскресенье",
// ];
// let day = 3;
// alert(arr[day]);

// // #9
// let arr = [
//   [1, 2, 3],
//   [4, 5, 6],
//   [7, 8, 9],
// ];
// alert(arr[1][0]);

// // #10
// let obj = { js: ["jQuery", "Angular"], php: "hello", css: "world" };
// alert(obj["js"][0]);

// // #11
// let arr = {
//   ru: [
//     "понедельник",
//     "вторник",
//     "среда",
//     "четверг",
//     "пятница",
//     "суббота",
//     "воскресенье",
//   ],
//   en: [
//     "monday",
//     "tuesday",
//     "wednesday",
//     "thursday",
//     "friday",
//     "saturday",
//     "sunday",
//   ],
// };
// alert(arr["ru"][0] + " " + arr["en"][2]);

// // #12
// let arr = {
//   ru: [
//     "понедельник",
//     "вторник",
//     "среда",
//     "четверг",
//     "пятница",
//     "суббота",
//     "воскресенье",
//   ],
//   en: [
//     "monday",
//     "tuesday",
//     "wednesday",
//     "thursday",
//     "friday",
//     "saturday",
//     "sunday",
//   ],
// };
// let lang = arr["ru"];
// let day = 3;
// alert(lang[day]);
